{
  "about": {
    "label": "About",
    "data": [
      {
        "subHeading": "",
        "size": 0,
        "type": "text",
        "data": "Hello! I’m Avish Kaushik, a passionate and driven Software Engineer with a strong background in full-stack development and cloud technologies. Currently, I work at Societe Generale Global Solution Center, where I have had the opportunity to lead and contribute to impactful projects such as the migration of legacy systems to internal cloud platforms. I bring expertise in programming languages like Java, C++, Python, and frameworks such as ReactJS, Spring Boot, and Kubernetes. \nWith a knack for problem-solving, I enjoy translating complex business requirements into seamless technical solutions. My work involves everything from architecture analysis and development to DevOps and infra management. Along the way, I’ve been recognized with several awards for my contributions to improving application performance and streamlining processes.\nIn addition to my professional experience, I have a strong foundation in computer science, having earned my B.Tech from Vellore Institute of Technology. I thrive in fast-paced, agile environments and am always eager to learn, grow, and take on new challenges. Feel free to explore my portfolio to see some of the exciting projects I’ve worked on!",
        "technologies": [
          "AGGrid",
          "Angular",
          "Azure",
          "DQL",
          "Express",
          "JAVA",
          "Jenkins",
          "Kubernetes",
          "MongoDB",
          "Node",
          "PostgreSQL",
          "Python",
          "RabbitMQ",
          "React",
          "SonarQube",
          "XL Deploy"
        ]
      }
    ]
  },
  "education": {
    "label": "Education",
    "data": [
      {
        "subHeading": "",
        "size": 0,
        "type": "education",
        "data": [
          {
            "name": "George Washington University",
            "board": "Master of Science in Computer Science",
            "grade": "Currently Enrolled",
            "date": "2024",
            "imgLocation": "GWU",
            "isLast": false,
            "isCurrent": true
          },
          {
            "name": "Vellore Insitute of Technology",
            "board": "Bachelor of Technology in Computer Science and Engineering",
            "grade": "CGPA: 9.06",
            "imgLocation": "VIT",
            "date": "2018-2022",
            "isLast": false,
            "isCurrent": false
          },
          {
            "name": "St. Theresa Sr. Secondary School",
            "board": "Senior Secondary",
            "grade": "Percentage: 84.8%",
            "imgLocation": "SCHOOL",
            "date": "2016-2018",
            "isLast": false,
            "isCurrent": false
          },
          {
            "name": "St. Theresa Sr. Secondary School",
            "board": "Higher Secondary",
            "grade": "CGPA: 9.2",
            "imgLocation": "SCHOOL",
            "date": "2014-2016",
            "isLast": true,
            "isCurrent": false
          }
        ]
      }
    ]
  },
  "experience": {
    "label": "Experience",
    "data": [
      {
        "subHeading": "",
        "size": 0,
        "type": "experience",
        "data": [
          {
            "name": "Societe Generale Global Solution Center",
            "from": "June 2022",
            "to": "July 2024",
            "designation": "Software Engineer Fullstack",
            "imgLocation": "SG",
            "isLast": false,
            "isCurrent": false,
            "wasLatest": true
          },
          {
            "name": "Societe Generale Global Solution Center",
            "from": "January 2022",
            "to": "June 2022",
            "designation": "Software Engineer Intern",
            "imgLocation": "SG",
            "isLast": false,
            "isCurrent": false,
            "wasLatest": false
          },
          {
            "name": "Kogniti",
            "from": "October 2021",
            "to": "January 2022",
            "designation": "Software Engineer Intern",
            "imgLocation": "none",
            "isLast": true,
            "isCurrent": false,
            "wasLatest": false
          }
        ]
      }
    ]
  },
  "project": {
    "label": "Projects",
    "data": [
      {
        "subHeading": "",
        "size": 0,
        "type": "project",
        "data": [
          {
            "name": "EDMS",
            "description": "The Electronic Document Management System (EDMS) project involved overseeing the modernization and migration of a legacy Documentum database to a cutting-edge internal cloud storage solution. The core objective was to ensure efficient archival and retrieval processes by transitioning to a more adaptable and scalable cloud-based architecture.",
            "points": [
              "Leading the migration, I managed the transition of complex, structured data with diverse flow requirements, seamlessly incorporating business management within the same interface. This included designing and developing an entirely new architecture for the migration process, utilizing microservices-based technologies such as RabbitMQ, DQL, Spring Boot, Kubernetes, Docker, and Jenkins to ensure smooth data flow and system reliability.",
              "The migration involved over 2 million existing data records, spanning more than 20 distinct document types, moved from the legacy document management system to the internal Cloud Platform. I developed a batch process leveraging Exchange Services to read and store documents and data from mailboxes into the Cloud, streamlining document storage and retrieval.",
              "Additionally, I designed and implemented widgets and features to automate document management and data feeding processes, making the transition from the legacy EDMS smoother for end users. In collaboration with stakeholders, I facilitated requirements gathering sessions to produce detailed requirement documents, user stories, and use cases, ensuring that the new system aligned with business needs.",
              "To accelerate the decommissioning of the legacy system, I worked closely with client applications to build a WebService that connected the legacy codebase to the new Cloud Platform, ensuring minimal disruption during the transition."
            ],
            "technologies": [
              "JAVA",
              "DQL",
              "RabbitMQ",
              "Jenkins",
              "Kubernetes",
              "SonarQube"
            ]
          },
          {
            "name": "Billing",
            "description": "The Billing project is an enterprise solution consisting of three key applications: Billing, DCMT, and DEMAT, developed to modernize and streamline document and data management processes. This project involved migrating large amounts of data and upgrading authentication systems to ensure seamless, secure operations for users.",
            "points": [
              "A central aspect of the project was the design and development of an entire architecture and utilities to support the migration from a legacy document management system to an internal Cloud Platform. This effort successfully migrated over 2 million data records with more than 20 different document types, ensuring that all critical business data—particularly invoices and contracts—were securely transferred and accessible in the cloud.",
              "To automate and optimize workflows, a new batch process was introduced, utilizing Exchange Services to read and store documents and data from mailboxes directly to the Cloud Platform. This allowed for more efficient document management while also reducing manual intervention.",
              "Another critical element was the migration from a legacy LDAP authentication system to modern OAuth2 authentication, which significantly improved the security and performance of the applications, enhancing user experience.",
              "Additionally, the project introduced a range of widgets and automated features that allowed users to easily manage documents and streamline data feeding processes. These tools played a vital role in transitioning users from a legacy Electronic Document Management System (EDMS) to the newly developed cloud-based platform. The applications were essential for front-end, middle office, back office, and operations teams, enabling them to efficiently validate, manipulate, and manage critical business data. Overall, the project enhanced security, performance, and automation across the organization’s document management processes."
            ],
            "technologies": [
              "JAVA",
              "Azure",
              "React",
              "Angular",
              "PostgreSQL",
              "Jenkins",
              "XL Deploy",
              "Kubernetes"
            ]
          },
          {
            "name": "FACT",
            "description": "FACT is a powerful application designed to simplify cost tracking and budget management within organizations. It is developed using a combination of modern technologies, including Angular for a dynamic and responsive frontend, AgGrid for handling large datasets and interactive data grids, MongoDB for flexible, high-performance data storage, and Java for robust backend processing.",
            "points": [
              "The core functionality of FACT revolves around helping organizations track expenses in real-time, monitor budget allocations, and analyze financial performance across different departments or projects. It enables users to efficiently input, update, and visualize cost data while maintaining a clear overview of their budgets. With real-time data updates, FACT ensures that financial data remains current and accurate, reducing the risk of overspending or budget mismanagement.",
              "The integration of AgGrid offers users powerful data manipulation features such as sorting, filtering, and editing within grid views, improving data accessibility. FACT also supports reporting and analytics, allowing users to generate detailed financial reports to aid in strategic decision-making.",
              "This application is vital for organizations aiming to streamline their financial processes, maintain transparency, and make informed budget-related decisions, ultimately leading to improved cost control and better financial health."
            ],
            "technologies": ["JAVA", "MongoDB", "Angular", "AGGrid"]
          },
          {
            "name": "Art Quest",
            "description": "Art Quest is an innovative educational project designed to provide students with an enhanced learning experience while supporting teachers in effectively teaching various concepts. The project's core aim is to bridge the gap between conventional education methods and modern technology, creating an engaging platform for both teachers and learners.",
            "points": [
              "A new version of the Art Quest application was developed using ReactJS, implementing a seamless and efficient flow throughout the platform. Key features include an interactive user interface designed with advanced technologies like Redux for state management, hooks, and timers to ensure smooth interactions and real-time feedback. Significant frontend enhancements were made, updating libraries and adopting more modern technologies to make the application more user-friendly.",
              "The development team focused on maintaining and optimizing the codebase, resulting in a fourfold improvement in performance. Regular testing sessions were conducted with teachers and students across the globe to evaluate the platform’s usability and its impact on the learning process. Feedback from these sessions was meticulously analyzed to pinpoint areas for improvement. This iterative approach led to continuous refinement, ensuring that Art Quest became more effective over time.",
              "Through these efforts, Art Quest has evolved into a powerful tool that not only enhances the learning experience for students but also provides educators with a dynamic platform for teaching a wide range of subjects."
            ],
            "technologies": ["React", "Node", "Express"]
          },
          {
            "name": "EduHUB",
            "description": "EduHUB is an innovative teaching tool designed to assist educators and enhance students' understanding of complex concepts like Data Structures and Algorithms. This project focuses on improving traditional learning methods by offering interactive visualizations that make abstract topics more tangible and engaging. ",
            "points": [
              "Built on the ReactJS framework, EduHUB incorporates custom CSS and animations to deliver a smooth and user-friendly interface, offering a seamless experience for both teachers and students. The platform is designed to visualize key computer science concepts, enabling users to interact with various Data Structures and Algorithms, including sorting and pathfinding techniques. By allowing learners to visualize these abstract concepts, EduHUB helps deepen comprehension and retention.",
              "The project features visualizations for five different data structures and supports the demonstration of approximately 16 algorithms, covering both sorting and searching techniques. New animation styles were crafted using CSS, providing smooth transitions and a more interactive interface that ensures users feel comfortable navigating the application. The platform aims to bridge the gap between theoretical learning and practical understanding, making it easier for students to grasp challenging concepts and for teachers to explain them more effectively.",
              "EduHUB is poised to revolutionize the way computer science is taught, providing both educators and learners with an intuitive and engaging educational experience."
            ],
            "technologies": ["React"]
          },
          {
            "name": "Teacher's Toolkit",
            "description": "Teacher's Toolkit is a Windows-based application developed using Python, designed to help educators manage their schedules, student-related tasks, and administrative responsibilities efficiently. It leverages PostgreSQL as its database, ensuring reliable data handling and scalability. The toolkit addresses the daily needs of teachers, enabling them to streamline lesson planning, monitor student performance, and manage classroom activities with ease.",
            "points": [
              "The application’s user interface is designed using the Tkinter library, offering a simple and intuitive experience for educators. The interface seamlessly integrates with the Python backend, which handles data retrieval, processing, and interactions with the PostgreSQL database. This modular approach ensures the system is both flexible and maintainable, allowing for future updates and feature expansions without significant rework.",
              "A key feature of the Teacher's Toolkit is its robust authentication system, which provides secure access control. Multiple user roles, such as teachers and administrators, are supported, each with specific permissions, ensuring data privacy and proper authorization for different tasks.",
              "The application also implements an intelligent re-routing mechanism to enhance user experience by directing users to relevant sections based on their role and task requirements. This helps reduce unnecessary steps, enabling users to focus on their core tasks more effectively.",
              "In addition, Teacher's Toolkit provides advanced data management capabilities, allowing educators to add, edit, and delete student records, schedule classes, and generate reports. With PostgreSQL as the backend, the application supports multiple concurrent connections, ensuring smooth performance even with multiple users.",
              "In summary, Teacher's Toolkit is a powerful tool for educators, combining ease of use, security, and efficient data management to enhance the teaching and administrative process."
            ],
            "technologies": ["Python", "PostgreSQL"]
          }
        ]
      }
    ]
  },
  "achievements": {
    "label": "Achievements & Awards",
    "data": [
      {
        "subHeading": "",
        "size": 0,
        "type": "showcase",
        "data": [
          {
            "id": "brainiac",
            "name": "Brainiac Award",
            "organization": "Societe Generale Global Solution Center",
            "flipname": "Brainiac Award",
            "description": "Recognized for exceptional innovation and strategic contributions, making a significant impact at Societe Generale Global Solution Centre.",
            "year": 2023,
            "display": false,
            "size": "100%"
          },
          {
            "id": "blspecial",
            "name": "BL Special Award",
            "organization": "Societe Generale Global Solution Center",
            "flipname": "BL Special Award",
            "description": "Awarded for outstanding performance, leadership, and the ability to drive critical projects successfully at Societe Generale Global Solution Centre.",
            "year": 2023,
            "display": false,
            "size": "100%"
          },
          {
            "id": "spot",
            "name": "Spot Award",
            "organization": "Societe Generale Global Solution Center",
            "flipname": "Spot Award",
            "description": "Honored for quick problem-solving skills and delivering immediate results, significantly contributing to team success at Societe Generale Global Solution Centre.",
            "year": 2023,
            "display": false,
            "size": "60%"
          },
          {
            "id": "reply",
            "name": "Global Rank 363 | National Rank 73",
            "organization": "Reply Code Challenge",
            "flipname": "Reply Code Challenge",
            "description": "Achieved Global Rank 363 and National Rank 73 in this highly competitive global coding event, demonstrating excellent programming skills.",
            "year": 2021,
            "display": false,
            "size": "100%"
          },
          {
            "id": "hashcode",
            "name": "Global Rank 2282 | National Rank 495",
            "organization": "Google HashCode",
            "flipname": "Google HashCode",
            "description": "Earned International Rank 2282 and National Rank 495 in Google's challenging coding competition, showcasing problem-solving and teamwork abilities.",
            "year": 2021,
            "display": false,
            "size": "50%"
          },
          {
            "id": "decipher",
            "name": "International Rank 39",
            "organization": "DeCipher by IEM Kolkata",
            "flipname": "DeCipher",
            "description": "Secured International Rank 39 in this competitive cryptography and coding challenge, reflecting strong analytical and coding expertise.",
            "year": 2019,
            "display": false,
            "size": "100%"
          },
          {
            "id": "sudoku",
            "name": "National Rank 1",
            "organization": "Quicky Sudoku Quiz by Akash Institute",
            "flipname": "Quicky Sudoku Quiz",
            "description": "Achieved National Rank 1 in this fast-paced Sudoku quiz, showcasing exceptional logical thinking and problem-solving speed.",
            "year": 2016,
            "display": false,
            "size": "90%"
          },
          {
            "id": "leetcode",
            "name": "Rating 1927 | Level Knight | Top 3.92%",
            "organization": "Leetcode",
            "flipname": "Leetcode",
            "description": "With a rating of 1927 and achieving the Knight level, I rank in the top 3.92%, demonstrating strong proficiency in solving complex algorithmic problems.",
            "year": 2024,
            "display": false,
            "size": "60%"
          }
        ]
      }
    ]
  }
}
